using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace App.Infra.Db.SqlServer.Ef.Migrations
{
    /// <inheritdoc />
    public partial class seeddataproductnew : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "CategoryId", "CreatedAt", "Description", "Image", "Inventory", "IsDeleted", "Price", "Title" },
                values: new object[,]
                {
                    { 8, 1, new DateTime(2025, 1, 8, 0, 0, 0, 0, DateTimeKind.Unspecified), "ساعت هوشمند سامسونگ Galaxy Watch 6، ترکیبی بی‌نظیر از زیبایی شناسی کلاسیک و تکنولوژی مدرن پوشیدنی است که برای پایش سلامتی و تناسب اندام شما طراحی شده است. این ساعت با حاشیه‌های باریک‌تر و صفحه‌نمایش بزرگ‌تر و شفاف‌تر از نسل قبل، تعامل با رابط کاربری را بسیار لذت‌بخش کرده است. کریستال سافایر به کار رفته در نمایشگر، مقاومت فوق‌العاده‌ای در برابر خط و خش ایجاد می‌کند تا در فعالیت‌های روزمره و ورزشی نگران آسیب دیدن آن نباشید.\r\n\r\nمهم‌ترین تمرکز سامسونگ در این مدل، بهبود خواب کاربر است. سنسورهای پیشرفته با پایش مراحل مختلف خواب و ارائه آنالیز دقیق (Sleep Coaching)، به شما کمک می‌کنند عادات خواب خود را اصلاح کنید و روز پرانرژی‌تری داشته باشید. سنسور BioActive سامسونگ نیز ترکیبی از سه حسگر قدرتمند است که ضربان قلب، نوار قلب (ECG) و تحلیل امپدانس بیوالکتریک (BIA) را اندازه‌گیری می‌کند؛ بدین ترتیب شما می‌توانید درصد چربی بدن، توده عضلانی و آب بدن خود را در هر لحظه بسنجید.\r\n\r\nقابلیت‌های ارتباطی این ساعت فراتر از انتظار است؛ امکان مکالمه مستقیم، پاسخ به پیام‌ها، و کنترل دوربین گوشی از راه دور تنها بخشی از امکانات آن هستند. باتری بهبود یافته با قابلیت شارژ سریع به شما اجازه می‌دهد با تنها 8 دقیقه شارژ، تا 8 ساعت از قابلیت پایش خواب استفاده کنید. این ساعت با طراحی شیک و بندهای قابل تعویض (One-Click)، هم برای جلسات رسمی و هم برای باشگاه ورزشی انتخابی ایده‌آل است.", "galaxy_watch6.jpg", 15, false, 12500000m, "ساعت هوشمند سامسونگ Galaxy Watch 6" },
                    { 9, 3, new DateTime(2025, 1, 9, 0, 0, 0, 0, DateTimeKind.Unspecified), "ماشین لباسشویی 9 کیلویی ال‌جی با بهره‌گیری از تکنولوژی هوش مصنوعی (AI DD)، فراتر از یک شستشوی ساده عمل می‌کند. این فناوری نه تنها وزن لباس‌ها را تشخیص می‌دهد، بلکه جنس پارچه را نیز شناسایی کرده و بر اساس آن، الگوی حرکت دیگ را انتخاب می‌کند. این ویژگی باعث می‌شود تا 18 درصد محافظت بیشتری از الیاف پارچه صورت گیرد و طول عمر لباس‌های مورد علاقه شما افزایش یابد.\r\n\r\nموتور Inverter Direct Drive در این محصول، با حذف تسمه و قطعات مکانیکی اضافی، لرزش و صدای دستگاه را به حداقل رسانده است، به طوری که حتی در هنگام خشک‌کن با دور بالا نیز آرامش خانه حفظ می‌شود. تکنولوژی بخارشوی (Steam+) یکی دیگر از ویژگی‌های کلیدی است که با نفوذ بخار به بافت لباس، 99.9 درصد از آلرژن‌ها و باکتری‌ها را از بین می‌برد و در عین حال چروک‌های لباس را تا 30 درصد کاهش می‌دهد، که این امر اتوکشی را بسیار آسان‌تر می‌کند.\r\n\r\nطراحی درب شیشه‌ای حرارت‌دیده و مخزن استیل ضد زنگ با خاصیت ضدباکتریایی، نشان‌دهنده کیفیت ساخت بالای این محصول است. قابلیت اضافه کردن لباس در حین شستشو (Add Item) برای زمان‌هایی که لباسی را فراموش کرده‌اید بسیار کاربردی است. همچنین با استفاده از سیستم عیب‌یابی هوشمند و اتصال به موبایل از طریق Wi-Fi، می‌توانید برنامه‌های شستشوی جدید را دانلود کرده و وضعیت دستگاه را از راه دور کنترل کنید.", "lg_washing_machine.jpg", 3, false, 32000000m, "ماشین لباسشویی 9 کیلویی ال‌جی" },
                    { 10, 2, new DateTime(2025, 1, 10, 0, 0, 0, 0, DateTimeKind.Unspecified), "این هودی مردانه با طراحی مینیمال و ساده، گزینه‌ای اساسی برای کمد لباس هر فرد شیک‌پوشی در فصول سرد سال است. پارچه استفاده شده در این محصول از نوع دورس سه نخ پنبه‌ای با کیفیت اعلاء است که داخل آن کرک‌دار (Brush) شده است. این ویژگی باعث می‌شود که هودی علاوه بر نرمی فوق‌العاده، گرمای بدن را به خوبی حفظ کند و برای روزهای پاییزی و زمستانی انتخابی بی‌نظیر باشد.\r\n\r\nدوخت‌های این محصول با دقت و ظرافت بالا انجام شده و در قسمت سرآستین‌ها و پایین لباس از کشبافت مقاوم استفاده شده تا از ورود سرما جلوگیری شود و فرم لباس در اثر شستشوهای مکرر تغییر نکند. کلاه هودی به صورت دولایه دوخته شده تا ایستایی زیبایی داشته باشد و بندهای تنظیم‌کننده آن دارای سر‌های فلزی هستند که به دوام و زیبایی کار می‌افزایند. جیب کانگورویی در جلوی لباس، فضای مناسبی برای گرم کردن دست‌ها یا قرار دادن گوشی و کلید فراهم می‌کند.\r\n\r\nرنگ‌بندی این هودی با استفاده از رنگ‌های ری‌اکتیو انجام شده که ثبات بسیار بالایی دارند و پس از شستشو دچار بور شدگی نمی‌شوند. قواره لباس به صورت آزاد (Relaxed Fit) طراحی شده که راحتی حرکت را تضمین می‌کند و به شما اجازه می‌دهد آن را به راحتی روی تیشرت یا زیر کاپشن و پالتو بپوشید. این هودی برای استایل‌های خیابانی (Street Style)، ورزش و استفاده روزمره در منزل کاملاً مناسب است.", "hoodie_men.jpg", 50, false, 980000m, "هودی مردانه طرح مینیمال" },
                    { 11, 4, new DateTime(2025, 1, 11, 0, 0, 0, 0, DateTimeKind.Unspecified), "کتاب C# in Depth اثر جان اسیت (Jon Skeet)، یکی از افسانه‌ای‌ترین چهره‌های دنیای دات‌نت و کاربران Stack Overflow، کتابی است که نگاه شما را به زبان سی‌شارپ عمیق‌تر می‌کند. اگر تصور می‌کنید سی‌شارپ را بلد هستید، این کتاب به شما نشان می‌دهد که چقدر هنوز برای یادگیری وجود دارد. این اثر برای مبتدیان نیست، بلکه برای توسعه‌دهندگانی است که می‌خواهند از سطح متوسط به سطح پیشرفته و حرفه‌ای ارتقا پیدا کنند.\r\n\r\nجان اسیت در این کتاب با بیانی دقیق و موشکافانه، تکامل زبان سی‌شارپ را از نسخه 2 تا جدیدترین نسخه‌ها بررسی می‌کند. او فقط به آموزش سینتکس نمی‌پردازد، بلکه «چرا»ها و «چگونه»های پشت پرده کامپایلر را توضیح می‌دهد. مباحثی مانند Async/Await، Expression Trees، Dynamic Typing و ویژگی‌های جدید Functional Programming در سی‌شارپ، با مثال‌هایی تشریح شده‌اند که ذهنیت شما را نسبت به کدنویسی تغییر می‌دهند.\r\n\r\nیکی از نقاط قوت کتاب، تمرکز بر دام‌هایی است که برنامه‌نویسان اغلب در آن‌ها گرفتار می‌شوند (Common Pitfalls). خواندن این کتاب به شما اعتماد به نفس می‌دهد تا از ویژگی‌های پیچیده زبان با اطمینان استفاده کنید و کدهایی بنویسید که نه تنها کار می‌کنند، بلکه بهینه، تمیز و اصولی هستند. این کتاب پلی است بین یک کدنویس معمولی و یک مهندس نرم‌افزار که بر ابزار کار خود تسلط کامل دارد.", "csharp_in_depth.jpg", 25, false, 380000m, "کتاب C# in Depth (ویرایش چهارم)" },
                    { 12, 5, new DateTime(2025, 1, 12, 0, 0, 0, 0, DateTimeKind.Unspecified), "خواب راحت و گرم در دل طبیعت وحشی و دمای زیر صفر، حیاتی‌ترین نیاز یک کوهنورد است. کیسه خواب پر (Down) با دمای کامفورت منفی 10 درجه، طراحی شده است تا در شرایط سخت زمستانی محافظ جان شما باشد. عایق داخلی این کیسه خواب از پر غاز با تراکم (Fill Power) 800 تشکیل شده که بهترین نسبت گرما به وزن را در میان عایق‌ها ارائه می‌دهد؛ به این معنی که با کمترین وزن و حجم، بیشترین گرما را تولید می‌کند.\r\n\r\nپارچه بیرونی از نایلون Ripstop ضد آب و ضد باد ساخته شده که در برابر پارگی بسیار مقاوم است و اجازه نفوذ رطوبت شبنم یا برف آب شده را به داخل نمی‌دهد. طراحی مومیایی شکل (Mummy) کیسه خواب باعث می‌شود فضای خالی اطراف بدن کاهش یابد و گرمای بدن سریع‌تر محیط داخلی را گرم کند. همچنین در قسمت پاها (Footbox) فضای اضافی در نظر گرفته شده تا پاها در حالت طبیعی و راحت قرار گیرند و گردش خون مختل نشود.\r\n\r\nیکی از ویژگی‌های بارز این محصول، زیپ‌های YKK دوطرفه است که امکان تهویه هوا در صورت گرم شدن بیش از حد را فراهم می‌کند. کلاه کیسه خواب دارای بندهای تنظیم شونده است که کاملاً دور صورت کیپ می‌شود و از هدر رفتن گرما از ناحیه سر جلوگیری می‌کند. این محصول همراه با یک کیسه استراحت (برای نگهداری در منزل) و یک کیسه فشرده‌سازی (Compression Sack) عرضه می‌شود که حجم آن را برای قرارگیری در کوله‌پشتی به اندازه یک توپ فوتبال کوچک می‌کند.", "sleeping_bag.jpg", 6, false, 5500000m, "کیسه خواب پر کوهنوردی" },
                    { 13, 1, new DateTime(2025, 1, 13, 0, 0, 0, 0, DateTimeKind.Unspecified), "آیپد ایر نسل 5 با بهره‌گیری از تراشه قدرتمند M1 (همان تراشه‌ای که در مک‌بوک‌های پرو استفاده شده)، مرز بین تبلت و لپ‌تاپ را از بین برده است. این دستگاه با قدرتی خیره‌کننده، امکان ویرایش ویدیوهای 4K، طراحی‌های سه‌بعدی سنگین و اجرای بازی‌های گرافیکی سطح کنسول را به راحتی فراهم می‌کند. با این حال، همچنان وزن بسیار سبک و ضخامت کمی دارد که حمل آن را در هر کیف دستی ممکن می‌سازد.\r\n\r\nصفحه‌نمایش 10.9 اینچی Liquid Retina با تکنولوژی True Tone و پوشش ضد بازتاب نور، تصاویری با رنگ‌های زنده و واقعی نمایش می‌دهد که برای طراحان گرافیک و هنرمندان دیجیتال یک بوم نقاشی ایده‌آل است. پشتیبانی از قلم اپل نسل 2 (Apple Pencil 2) که به صورت مغناطیسی به بدنه می‌چسبد و شارژ می‌شود، تجربه نوشتن و طراحی را به قدری روان و دقیق کرده که حس کار با کاغذ و قلم واقعی را تداعی می‌کند.\r\n\r\nدوربین سلفی 12 مگاپیکسلی اولترا واید با قابلیت Center Stage، به صورت هوشمند شما را در حین تماس‌های ویدیویی دنبال می‌کند تا همیشه در مرکز کادر باشید. درگاه USB-C در این نسل سرعت انتقال داده دو برابری دارد و امکان اتصال مستقیم به درایوهای اکسترنال، دوربین‌ها و نمایشگرهای بزرگ را فراهم می‌کند. حسگر اثر انگشت Touch ID ادغام شده با دکمه پاور، امنیت دستگاه را تضمین کرده و دسترسی سریع را ممکن می‌سازد.", "ipad_air5.jpg", 8, false, 29000000m, "تبلت اپل iPad Air 5" },
                    { 14, 3, new DateTime(2025, 1, 14, 0, 0, 0, 0, DateTimeKind.Unspecified), "جاروبرقی بوش سری 8، شاهکار مهندسی آلمان، ترکیبی از قدرت مکش فوق‌العاده و عملکرد بی‌صدا است. سیستم QuattroPower در این دستگاه تضمین می‌کند که با کمترین مصرف انرژی، بیشترین کارایی تمیزکنندگی حاصل شود. موتور پیشرفته این دستگاه با گارانتی 10 ساله، خیال شما را از بابت طول عمر و دوام آن کاملاً راحت می‌کند. این جاروبرقی حتی ریزترین ذرات گرد و غبار را که در عمق تار و پود فرش نفوذ کرده‌اند، بیرون می‌کشد.\r\n\r\nیکی از مهم‌ترین ویژگی‌های این مدل برای افراد مبتلا به آلرژی، سیستم فیلتراسیون HEPA قابل شستشو است. این فیلتر 99.95 درصد از ذرات ریز، باکتری‌ها و آلاینده‌ها را جذب می‌کند و هوایی که از دستگاه خارج می‌شود، تمیزتر از هوای محیط اتاق است. کیسه گرد و غبار با ظرفیت XXL (5 لیتر) نیاز به تعویض مکرر را از بین می‌برد و با طراحی چند لایه، حتی هنگام تعویض نیز گرد و خاک را در خود حبس می‌کند.\r\n\r\nلوله تلسکوپی و خرطومی کنفی با بافت بسیار مقاوم، در برابر کشیدگی و پارگی مقاوم هستند. سری‌های متنوع همراه دستگاه، تمیز کردن درز مبل‌ها، پرده‌ها و گوشه‌های غیرقابل دسترس را آسان می‌کنند. سیستم PowerProtect تضمین می‌کند که حتی با پر شدن کیسه، مکش دستگاه افت نکند. حرکت روان چرخ‌های فلزی با قابلیت چرخش 360 درجه، جابجایی دستگاه روی انواع سطوح سرامیک و فرش را بدون آسیب رساندن به آن‌ها ممکن می‌سازد.", "bosch_vacuum.jpg", 4, false, 14500000m, "جاروبرقی بوش سری 8" },
                    { 15, 2, new DateTime(2025, 1, 15, 0, 0, 0, 0, DateTimeKind.Unspecified), "شلوار جین راسته (Regular Fit) کلاسیک، آیتمی است که هرگز از مد نمی‌افتد و پایه ثابت استایل آقایان شیک‌پوش است. این شلوار از پارچه دنیم (Denim) صد درصد پنبه‌ای با گرماژ بالا تهیه شده است که دوام و مقاومت بسیار بالایی در برابر ساییدگی و پارگی دارد. برخلاف شلوارهای جین نازک و کشی، این مدل ایستایی بسیار محکم و مردانه‌ای دارد و با گذشت زمان و استفاده مداوم، فرم خود را حفظ کرده و حتی زیباتر می‌شود (اصطلاحاً جا باز می‌کند).\r\n\r\nرنگ سرمه‌ای تیره (Dark Wash) این شلوار با فرآیندهای سنگ‌شور صنعتی دقیق به دست آمده که ظاهری اصیل و باوقار به آن بخشیده است. این رنگ به راحتی با انواع پیراهن‌های سفید، تیشرت‌های رنگی و حتی کت‌های اسپرت ست می‌شود و هم برای محیط‌های نیمه‌رسمی و هم برای دورهمی‌های دوستانه مناسب است. دوخت‌های دو سوزنه با نخ ضخیم نارنجی رنگ، علاوه بر استحکام درزها، جلوه‌ای کلاسیک و جذاب به کار داده است.\r\n\r\nدکمه‌ها و پرچ‌های فلزی به کار رفته از آلیاژ ضد زنگ هستند و زیپ روان و باکیفیت YKK استفاده شده در آن، سال‌ها بدون مشکل کار خواهد کرد. این شلوار دارای 5 جیب استاندارد (شامل جیب کوچک سکه) است. الگوی برش آن به گونه‌ای است که در قسمت ران و زانو آزادی عمل کافی را فراهم می‌کند و برای استفاده طولانی مدت در طول روز کاملاً راحت است.", "jeans_pant.jpg", 60, false, 1200000m, "شلوار جین راسته مردانه" },
                    { 16, 5, new DateTime(2025, 1, 16, 0, 0, 0, 0, DateTimeKind.Unspecified), "در کوهنوردی شبانه، غارنوردی یا کمپینگ، داشتن نور مناسب و دست‌های آزاد، کلید ایمنی و موفقیت است. چراغ پیشانی (هدلامپ) پتزل مدل Actik Core با قدرت روشنایی 450 لومن، تاریک‌ترین مسیرها را برای شما مثل روز روشن می‌کند. این مدل دارای پرتو نور ترکیبی (Wide و Focused) است؛ پرتو عریض برای دیدن محیط اطراف در کمپ و پرتو متمرکز برای دیدن فواصل دور در هنگام حرکت طراحی شده است.\r\n\r\nویژگی انقلابی این محصول تکنولوژی Hybrid Concept است؛ به این معنی که هم با باتری شارژی لیتیومی (Core) که در جعبه موجود است کار می‌کند و هم در شرایط اضطراری می‌توانید از سه عدد باتری نیم‌قلمی معمولی استفاده کنید. این قابلیت در سفرهای طولانی که دسترسی به برق برای شارژ وجود ندارد، بسیار حیاتی است. نور قرمز تعبیه شده در این هدلامپ برای دید در شب بدون خیره کردن چشم هم‌نوردان و یا خواندن نقشه در تاریکی کاربرد دارد و حالت چشمک‌زن آن می‌تواند در شرایط اضطراری برای درخواست کمک از فواصل دور (تا 700 متر) دیده شود.\r\n\r\nاستاندارد ضد آب IPX4 باعث می‌شود که بتوانید زیر بارش باران و برف با خیال راحت از آن استفاده کنید. بند پیشانی آن دارای خاصیت بازتاب‌دهنده نور است که باعث می‌شود در تاریکی دیده شوید و سوت نجات تعبیه شده روی بند، برای مواقع خطر بسیار کارآمد است. با وجود تمام این امکانات، وزن این هدلامپ تنها 75 گرم است و هیچگونه سنگینی روی پیشانی احساس نخواهید کرد.", "headlamp.jpg", 12, false, 1600000m, "چراغ پیشانی (هدلامپ) پتزل" }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 16);
        }
    }
}
